const km = {
  search: "ស្វែងរក...",
  note: {
    all: "កំណត់ចំណាំទាំងអស់",
    new: "កំណត់ចំណាំថ្មី",
    pinned: "ដាក់ខ្ទាស់",
    selectToView: "ជ្រើសរើសកំណត់ចំណាំ ដើម្បីមើលព័ត៌មានលម្អិត",
    loading:'កំពុងផ្ទុកកំណត់ត្រា...'
  },
  dialog: {
    delete: {
      header: "បញ្ជាក់ការលុប",
      desc: "តើអ្នកប្រាកដថាចង់លុបកំណត់ចំណាំនេះ {name} មែនទេ?",
    },
    logout: {
      header: "បញ្ជាក់ការចាកចេញ",
      desc: "តើអ្នកប្រាកដថាចង់ចាកចេញមែនទេ?",
    },
  },
  empty: {
    search: {
      title: "រកមិនឃើញលទ្ធផល",
      desc: 'រកមិនឃើញកំណត់ចំណាំសម្រាប់ "{query}"។ សូមព្យាយាមស្វែងរកពាក្យផ្សេង។',
    },
    notes: {
      title: "មិនទាន់មានកំណត់ចំណាំនៅឡើយទេ",
      desc: "បង្កើតកំណត់ចំណាំដំបូងរបស់អ្នក ដើម្បីចាប់ផ្តើមរៀបចំគំនិតរបស់អ្នក",
      button: "បង្កើតកំណត់ចំណាំ",
    },
  },
  button: {
    submit: "ដាក់ស្នើ",
    cancel: "បោះបង់",
    confirm: "បញ្ជាក់",
    logout: "ចាកចេញ",
    delete: "លុប",
    pinned: "ដាក់ខ្ទាស់",
  },
};

export default km;
